/**
 * Головний клас для запуску додатку енергетичного калькулятора.
 * 
 * @author Ярослав Пічугін
 * @version 1.0
 */
public class Main {
    
    /**
     * Головний метод для запуску графічного інтерфейсу користувача.
     * Створює об'єкт класу EnergyGUI та викликає метод display.
     * 
     * @param args Масив рядків, який може бути використаний для передачі аргументів командного рядка.
     */
    public static void main(String[] args) {
        // Створення об'єкта інтерфейсу користувача
        EnergyGUI energyGUI = new EnergyGUI();
        
        // Викликає метод для відображення GUI
        energyGUI.display();
    }
}
